app/controllers/categories_controller.rb

  def show
    @products = Product.find(:all, :conditions => ['category_id = ?', @category.id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 18) LIMIT 1

  def load_category
    @category = Category.find_by_id(params[:id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = '9') LIMIT 1