app/controllers/orders_controller.rb

SELECT * FROM `items` WHERE (`items`.order_id = 56)
---
  def checkout
    if session[:cart].cart_items.blank?

SELECT * FROM `orders` WHERE (`orders`.`id` = '56') LIMIT 1
SELECT * FROM `products` WHERE (`products`.`id` = 18) LIMIT 1
---
  def show
    @order = Order.find_by_id(params[:id])
    @products = @order.order_products

SELECT * FROM `orders` WHERE (`orders`.`id` = '57') LIMIT 1
---
  def order_payment
    @order = Order.find_by_id(params[:id])