app/controllers/products_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = '24') LIMIT 1
---
    def load_product
      @product = Product.find_by_id(params[:id])