app/controllers/sessions_controller.rb

SELECT * FROM `accounts` WHERE (`accounts`.`email` = 'megha@gmail.com') LIMIT 1
---
  def create
    account = Account.authenticate(params[:email], params[:password])
    if account && account.activation_token.blank?