app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
    def load_current_user
        @user = User.find_by_id(current_account.resource_id)